<template>
  <div class="container">
    <h2>Урок номер 7</h2>
    <button class="btn btn-primary" @click="isModalOpen = !isModalOpen">Открыть модалку</button>
    <modal v-if="isModalOpen" @close="closeModal">
      <p>Следует отметить, что консультация с широким активом не даёт нам иного выбора, кроме определения своевременного выполнения сверхзадачи. С другой стороны, синтетическое тестирование не оставляет шанса для системы массового участия. Равным образом, дальнейшее развитие различных форм деятельности предполагает независимые способы реализации приоретизации разума над эмоциями. Мы вынуждены отталкиваться от того, что внедрение современных методик однозначно фиксирует необходимость приоретизации разума над эмоциями. Принимая во внимание показатели успешности, социально-экономическое развитие говорит о возможностях экономической целесообразности принимаемых решений. А ещё акционеры крупнейших компаний призваны к ответу.</p>
      <p>Но понимание сути ресурсосберегающих технологий, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для поставленных обществом задач. Кстати, акционеры крупнейших компаний лишь добавляют фракционных разногласий и обнародованы.</p>
      <p>Картельные сговоры не допускают ситуации, при которой базовые сценарии поведения пользователей в равной степени предоставлены сами себе. Повседневная практика показывает, что курс на социально-ориентированный национальный проект играет определяющее значение для своевременного выполнения сверхзадачи. Есть над чем задуматься: базовые сценарии поведения пользователей объявлены нарушающими общечеловеческие нормы этики и морали. Господа, высокое качество позиционных исследований создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса анализа существующих паттернов поведения. Современные технологии достигли такого уровня, что высокотехнологичная концепция общественного уклада предопределяет высокую востребованность инновационных методов управления процессами.</p>
    </modal>
  </div>
</template>

<script>
import modal from '../components/modal.vue';
export default {
  name: 'Lesson-7',
  components: {modal},
  data() {
    return {
      isModalOpen: false,
      modal: {
        title: 'Новая модель организационной деятельности продолжает удивлять'
      }
    }
  },
  methods:{
    closeModal() {
      this.isModalOpen = false
    }
  }
}
</script>

<style scoped>
</style>
